Tekla Open API Reference for Tekla Structures 2025
BentPlate Constructor
 Initializes a new instance of the BentPlate class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BentPlate()
Public Sub New
See Also
Reference
BentPlate Class
Tekla.Structures.Model Namespace